/* Testing dos commands present in rexxsupport */
say makedir("rxados_test")
say rename("rxados_test","rxados_rename")
say rename("rxados_test","rxados_rename")
say delete("rxados_rename")
say delete("unexistant")
