/* Test forbid()/enable() with first a permit() call */
say permit()
say permit()
say forbid()
say forbid()
say permit()
say forbid()
say forbid()
say permit()
