/* Test forbid()/enable() with first a forbid() call */
say forbid()
say forbid()
say permit()
say permit()
say forbid()
say permit()
say permit()
say forbid()
