====================
Ενημέρωση Κατάστασης
====================

:Συγγραφέας:   Paolo Besser
:Ημερομηνία:     2007-09-08

Τελευταία νέα
-------------

Ο Michal Schulz εργάζεται πάνω στις x86-64 εκδόσεις των χαμηλού επιπέδου
τμημάτων της exec.library - τους χειριστές προγράμματος και διακοπών.
Ο κώδικας bootstrap έχει αλλάξει πολύ και ήταν δυνατόν να κάνει compile
αρκετές βιβλιοθήκες (χάρη στη γιγαντιαία προσπάθεια του Henning Kiel, που 
διόρθωσε τον πηγαίο κώδικα για 64-bit συμβατότητα) σε ξεχωριστά modules. 
Με άλλα λόγια, ο 64-bit πυρήνας είναι έτοιμος να εκκινηθεί, με πολυδιεργασία
και έναρξη της πορείας autoinit της exec.library σύντομα.

Αν έχετε εγκαταστήσει ένα παλαιό nightly build του AROS, παρακαλούμε 
πηγαίνετε στην κατηγορία download και πάρτε ένα καινούργιο. Έχουν εφαρμοστεί
πολλά σημαντικά bugfixes, όπως επίσης έγιναν και μερικές αισθητικές βελτιώσεις. 
Μετά το διαγωνισμό μας, έχουμε δύο προεπιλεγμένα "επίσημα" wallpapers 
εγκατεστημένα: Το `"AROS rose" από τον d980`__ για την επιφάνεια εργασίας,
και το `"AROS"`__ από τον Wesper για τα παράθυρα.

Αν σχεδιάζετε να περάσετε μερικές ημέρες στην Τοσκάνη (Ιταλία) στις 
22 και 23 Σεπτεμβρίου, μη ξεχάσετε να επισκεφτείτε το Έμπολι. Το Σάββατο 22 
στις 16:00 το AROS θα παρουσιαστεί στο σόου `Pianeta Amiga 2007`__.

Μερικές ακόμα ωραίες εφαρμογές έχουν μεταφερθεί στο AROS. Αποκτήσαμε πρόσφατα 
την MUIbase, μια σχεσιακή βάση δεδομένων και το `Hively Tracker`__, έναν επεξεργαστή
mods μορφής AHX. Μπορείτε να τα βρείτε και τα δύο στα `Archives`__ ως συνήθως. 


__ http://ist-krieg.de/gallery/v/kyynel/projekte/aroswallpapercompetition/preselection/d980-04_aros-rose.jpg.html
__ http://ist-krieg.de/gallery/v/kyynel/projekte/aroswallpapercompetition/preselection/wesssper-01_aros.png.html
__ http://www.pianetaamiga.it
__ http://www.hivelytracker.com/index.php
__ http://archives.aros-exec.org 

