=========================================
AROS Руководство по разработке приложений
=========================================

:Авторы:    Staf Verhaegen, Sebastian Rittau, Stefan Rieken, Matt Parsons,
            Adam Chodorowski, Fabio Alemagna, Matthias Rustler
:Copyright: Copyright (C) 1995-2008, The AROS Development Team
:Версия:    $Revision$
:Дата:      $Date$
:Статус:    Не завершено; в процессе объединения (впереди долгий путь).
:Сделать:   Объединить разные части. Обновить и проверить. Завершить...

.. Предупреждение::

   Этот документ не окончен! Вполне возможно, что многие части устарели,
   содержат некорректную информацию или полностью отсутствуют. Если
   вы хотите исправить их, пожалуйста сообщите нам.


----------
Содержание
----------

+ `Введение`__
+ `Система сборки`__
+ `Исполняемая библиотека`__
+ `Библиотека Dos`__
+ `Графическая библиотека`__
+ `Intuition library`__
+ `Отслеживание ресурсов`__
+ `Многозадачность`__
+ `Локализация`__
+ `Написание портируемых приложений`__

__ introduction
__ buildsystem
__ exec-library
__ dos-library
__ graphics-library
__ intuition-library
__ resource-tracking
__ multitasking
__ localization
__ portable
