Χρειαζόμαστε τη βοήθεια σας!
============================

Διαθέτουμε λίγους αλλά αρκετά ενεργούς υπεύθυνους ανάπτυξης, κάτι το οποίο δυστυχώς
σημαίνει ότι η πρόοδος είναι σχετικά αργή. Χρειαζόμαστε απλά περισσότερους
ανθρώπους να μας βοηθήσουν! Υπάρχει ένας τεράστιος αριθμός από εργασίες που
απαιτούν έναν αφοσιωμένο υπεύθυνο ανάπτυξης. Κυμαίνονται από μεγάλα projects
ως πολύ μικρά, από το hacking υλικού, μέχρι τον προγραμματισμό εφαρμογών. Υπάρχει
βασικά κάτι για τον καθένα που θέλει να συνεισφέρει, ανεξαρτήτως της ικανότητας
του στη συγγραφή κώδικα!

Για εσάς οι οποίοι δεν είσαστε προγραμματιστές, υπάρχουν ακόμα πολλές εργασίες 
στις οποίες μπορείτε να βοηθήσετε! Αυτές συμπεριλαμβάνουν τη συγγραφή τεκμηρίωσης, 
τη μετάφραση προγραμμάτων και των τεκμηριώσεων τους σε άλλες γλώσσες, τη δημιουργία 
όμορφων γραφικών και το κυνήγι των bugs. 
Αυτά είναι σχεδόν το ίδιο σημαντικά με τη συγγραφή κώδικα!
