====================
Ενημέρωση Κατάστασης
====================

:Συγγραφέας:   Paolo Besser
:Ημερομηνία:     2007-11-29

64-BIT AROS!
------------

Ο `Michal Schulz`__ έκανε το θαύμα, και ένα ολόκληρο νέο κεφάλαιο
στην ιστορία του AROS αρχίζει. Ξεκινώντας από σήμερα, μπορείτε να
κατεβάσετε την 64 bit native έκδοση του AROS από την ιστοσελίδα μας. 
Αυτή η νέα έκδοση είναι προφανώς πιο προχωρημένη από τη συνήθη,
και έχει περιορισμένη προστασία μνήμης και δυνατότητα φόρτωσης modules εκκίνησης. 
Το αρχικό όριο των 4 GB μνήμης RAM θα αφαιρεθεί όταν ενσωματωθεί
ορθός χειρισμός MMU. Για να εκτελέσετε την 64 bit native έκδοση του AROS
απαιτείται ένας 64-bit x86 επεξεργαστής όπως ο AMD Athlon 64 ή ο τελευταίος
Intel Core2.


VmwAROS
-------

Μία νέα διανομή του AROS έχει γεννηθεί. Το `VmwAROS`__ είναι ένα 
προ-εγκατεστημένο και προ-ρυθμισμένο περιβάλλον AROS για το VMware, 
συμβατό με τις Windows και Linux εκδόσεις του VMware Player, Server
και Workstation (v5 ή 6). Αυτή η διανομή απέχει ακόμα αρκετά
από την ολοκλήρωση, όμως παρόλα αυτά μια αρχική `beta`__ έκδοση
έχει κυκλοφορήσει για όποιον ρισκάρει να την τεστάρει. Το κοινό του 
VmwAROS είναι οι καθημερινοί χρήστες και προγραμματιστές και οποιοσδήποτε
άλλος δείχνει ενδιαφέρον στο να δοκιμάσει το AROS, αλλά δε θέλει
να βάλει σε κίνδυνο τα δεδομένα του σκληρού του δίσκου.
Κάντε κλικ `εδώ για περισσότερα`__.


Αλλες ειδήσεις
--------------

Το μέλος του Aros-Exec, Fishy_fis ανακοίνωσε μια νέα διανομή του AROS 
με το όνομα `Velocity`__. Μια αρχική beta έκδοση θα κυκλοφορήσει σύντομα. 
"Η διανομή Velocity θα προσφερθεί αρχικά και σε live CD και ως VMWare 
image και θα περιέχει σημαντικά περισσότερο (και προ-ρυθμισμένο) 
λογισμικό απ' ότι οι εικόνες ISO των nightly builds". Περιέχονται screenshots.

Ο Robert Norris εργάζεται στον Περιηγητή Ιστού για το AROS βασισμένο στο Webkit,
με το όνομα Traveller. Ενώ δουλεύει πάνω σε αυτό, ενημέρωσε επίσης πολλές από
τις βιβλιοθήκες του AROS και έχει ήδη μεταφέρει μερικές χρήσιμες εφαρμογές, 
όπως libxml2, cURL, OpenSSL, SQLite και περισσότερα. Μερικές πληροφορίες υπάρχουν
στο `blog του`__.


__ http://msaros.blogspot.com
__ http://www.vmwaros.org
__ http://vmwaros.blogspot.com/2007/11/vmwaros-beta-01-released.html
__ http://vmwaros.blogspot.com/2007/11/here-we-go.html
__ http://aros-exec.org/modules/newbb/viewtopic.php?topic_id=2434
__ http://cataclysm.cx

