====================
Ενημέρωση Κατάστασης
====================

:Συγγραφέας:   Paolo Besser
:Ημερομηνία:     2007-06-17

Τελευταία νέα
-------------

Η παγκοσμιοποίηση του AROS συνεχίζεται! Ο Ιωάννης Κονιάρης έχει μεταφράσει τη σελίδα 
`AROS.org στα Ελληνικά`__.

Τις τελευταίες εβδομάδες αντιμετωπίσαμε μερικά τεχνικά προβλήματα με τη build machine μας,
οπότε σας ζητούμε συγνώμη αν δεν μπορούσατε να κατεβάσετε τα ανανωμένα nightly builds. Εντούτοις
το πρόβλημα έχει λυθεί με μια ολοκαίνουργια build machine από τον Robert Norris.

Τρία νέα ενδιαφέροντα bounties έχουν "ανοίξει" πρόσφατα στην TeamAROS: 
παρακαλούμε ρίξτε μία ματιά στα `AROS on SAM440`__, `disk validator`__ και 
`creation of a new AROS distro`__.

Θα επιθυμούσαμε πραγματικά να ευχαριστήσουμε τον καθένα που συμμετέχει 
στην καλλιτεχνία του AROS: τις τελευταίες εβδομάδες λάβαμε πολλά νέα
wallpaper για το `διαγωνισμό`__ μας και μερικά νέα `banners`__ επίσης. 
Αν είσαστε υπεύθυνος μιας ιστοσελίδας ή συμμετέχεται ενεργά σε ένα
φόρουμ, μπορείτε να βοηθήσετε στην εξάπλωση του AROS χρησιμοποιώντας 
ένα από αυτά και συνδέοντας το με (την έκδοση της δικιάς σας γλώσσας)
τη σελίδα μας Aros.org.


__ http://www.aros.org/el
__ http://thenostromo.com/teamaros2/?number=60
__ http://thenostromo.com/teamaros2/?number=59
__ http://thenostromo.com/teamaros2/?number=58
__ http://aros-exec.org/modules/news/article.php?storyid=227
__ http://aros.sourceforge.net/linking.php
