====================
Ενημέρωση Κατάστασης
====================

:Συγγραφέας:   Paolo Besser
:Ημερομηνία:     2007-10-01

Τελευταία νέα
-------------

Τρομερά Νέα! Ο Neil Cafferkey έχει ενσωματώσει έναν ολοκαίνουργιο `installer`__ 
για το AROS, επιτρέποντας μια καθαρότερη και ασφαλέστερη εγκατάσταση σε σκληρούς δίσκους. 
Τα νέα χαρακτηριστικά είναι τα ακόλουθα:

- Ο οδηγός εγκατάστασης και οι κατατμήσεις μπορούν τώρα να καθοριστούν.
- Η δημιουργία κατάτμησης Work τώρα λειτουργεί.
- Τα μεγέθη των κατατμήσεων μπορούν τώρα να καθοριστούν και υπάρχουσες κατατμήσεις μπορούν να προστατευτούν.
- Τα Windows προστέθηκαν τώρα στο μενού εκκίνησης του GRUB σε περίπτωση που βρεθεί μια ενεργή κατάτμηση συστήματος Windows.
- Η εντοπιότητα μπορεί να καθοριστεί κατά τη διάρκεια της εγκατάστασης.


Εντούτοις, παρακαλούμε να έχετε στο νου σας ότι αυτό αποτελεί ακόμα δοκιμαστικό λογισμικό.
Ακολουθούν μερικές προειδοποιήσεις από τον Neil: "Ο νέος HD installer συμπεριλαμβάνεται τώρα 
στο nightly ISO και είναι έτοιμος για έλεγχο. Παρόλα αυτά, υπάρχει ένα bug είτε στο Wanderer 
είτε στο FFS που χρειάζεται να επιλυθεί. Μετά την επανεκκίνηση του installer, θα πρέπει να 
τερματίσετε το Wanderer πριν να συνεχίσετε (εκτός και αν δεν πρόκειται να διαμορφώσετε καμία κατάτμηση).
Να είσαστε περισσότερο προσεκτικός από το συνηθισμένο με αυτήν την έκδοση του installer, δηλ. 
μην εκθέσετε μια μηχανή με δεδομένα χωρίς αντίγραφα ασφαλείας σε αυτόν. Κανονικώς θα πρέπει να μπορέσει 
να προστατεύσει όλες τις υπάρχουσες κατατμήσεις αν ζητηθεί, αλλά κανείς άλλος πέρα από εμένα δεν το έχει
ελέγξει μέχρι στιγμής.


Εάν έχετε μια μηχανή δοκιμής χωρίς κανένα σημαντικό δεδομένο σε αυτήν, θα ήταν πολύ βοηθητικό
να κάνετε download το 10-01 nightly build (ή νεότερο) και να μας βοήθησετε να εντοπίσουμε bugs. 
Μπορείτε να χρησιμοποιήσετε τον Ανιχνευτή Bugs ή να δημοσιεύσετε ένα μήνυμα σε αυτήν τη `συζήτηση`__
στο AROS-Exec. 


Επίδειξη του AROS
-----------------

Όπως υπήρχαν προσδοκίες προηγουμένως σε αυτήν την ιστοσελίδα, το AROS ήταν guest 
star του `Pianeta Amiga 2007`__. Κατά τη διάρκεια του δημοφιλούς Amiga σόου, 
ο Paolo Besser παρουσίασε το AROS σε ομάδα ενδιαφερόμενων φίλων της Amiga. 
Το γεγονός αναμενόταν από μερικές σημαντικές ιστοσελίδες ειδήσεων του IT χώρου
όπως η `TGM Online`__ και η `HW Upgrade`__. Μια αναφορά του σόου έχει δημοσιευτεί
στο `The AROS Show`__ (διαβάστε την `εδώ`__). Μπορείτε επίσης να δείτε ένα
ωραίο `βίντεο`__ στο YouTube.

Το AROS Παγκοσμίως
------------------

Η ιστοσελίδα μας έχει αποκτήσει μερικές νέες μεταφράσεις τεκμηρίωσης - συγκεκριμένα, στα Ελληνικά
(από τον Ιωάννη Κονιάρη), στα Ισπανικά (από τον Ariel Gomez) και στα Τσέχικα (από τον Petr Novak), 
με τη συνηθισμένη και απαραίτητη βοήθεια από τον Neil Cafferkey. Ανανεώσεις των Σουϊδικών (από τον
Jon Anderson) και των Ρώσσικων (από τον Softy) μεταφράσεων αναμένονται σύντομα. Επίσης αναμένονται
περισσότερες ανανεώσεις σε περισσότερες γλώσσες (από... εσάς;).

__ http://mama.indstate.edu/users/nova/installer.jpg
__ http://aros-exec.org/modules/newbb/viewtopic.php?topic_id=2319
__ http://www.pianetaamiga.it/2007/eng/
__ http://tgmonline.futuregamer.it/news/settembre2007/20070910111905
__ http://www.hwupgrade.it/news/videogiochi/presentazione-italiana-per-l-os-indipendente-aros_22619-0.html
__ http://arosshow.blogspot.com
__ http://arosshow.blogspot.com/2007/09/pianeta-amiga-2007-report-from-paolo.html
__ http://video.google.it/videoplay?docid=-3563710058663289244
