====================
Ενημέρωση Κατάστασης
====================

:Συγγραφέας:   Paolo Besser
:Ημερομηνία:     2007-11-15

Τελευταία νέα
-------------

Το AROS δέχτηκε πολλές διορθώσεις και βελτιώσεις τις τελευταίες 
εβδομάδες. Για παράδειγμα, ο Neil Cafferkey διόρθωσε μερικά σημαντικά
προβλήματα στον αγαπημένο του `AROS Installer`__, ο Nic Andrews εργάστηκε
στον RTL8139 οδηγό δικτύου του και ο Robert Norris διόρθωσε διάφορες
ειδοποιήσεις αρχείων, που προηγουμένως δημιουργούσαν πρόβλημα στις
προτιμήσεις, για να αναφέρουμε απλά τρεις. 

Ο Robert Norris πρόσθεσε έναν οδηγό SDL για την hosted έκδοση του AROS στο linux. 
Αυτό σας επιτρέπει να κάνετε build μια hosted έκδοση του AROS που δεν απαιτεί
τον X (δεν είναι αναγκαίο καν να είναι εγκατεστημένος για κάνετε build άλλο πια). 
Θεωρητικά αυτό θα μπορούσε να βοηθήσει στην εκτέλεση εκδόσεων hosted σε άλλες πλατφόρμες 
(οπουδήποτε υπάρχει SDL), αν και είναι λίγο πιο αργές απ' ότι με τον οδηγό X.

Ο Matthias Rustler μετέφερε την ptplay.library στο AROS. Μπορεί να κάνει render 
Protracker modules σε δείγματα ήχου. Επιπρόσθετα μετέφρε επίσης και τον 
ShellPlayer, ένα απλό πρόγραμμα αναπαραγωγής ήχου. Θα υπάρχουν στα nightly
builds, στον κατάλογο Extras/MultiMedia/Audio.

Ο Matthias Rustler έχει κάνει μια αρχική μεταφορά της `Wazp3D`__ του Alain Thellier 
στο AROS. Η Wazp3D είναι μια βιβλιοθήκη φτιαγμένη να είναι συμβατή με την διάσημη 
Warp3D.library για το AmigaOS 68040 και κάνει ευκολότερο το έργο μεταφοράς μερικών 
3D παιχνιδίων της Amiga στο AROS. Η Wazp3D μπορεί ακόμα να λειτουργήσει ως software renderer,
ξεγελώντας εφαρμογές που αναζητούν για 3D οδηγούς υλικού.

Ο Michal Schulz έκανε μερικά μεγάλα βήματα μπροστά με την `x86-64`__ μεταφορά του AROS. 
Η ημέρα που θα κάνει την εμφάνιση του το 64 bit AROS πλησιάζει. Εντωμεταξύ, ο Michal 
πρόσθεσε επίσης υποστήριξη για οδηγίες SSE στο AROS.

Ο Petr Novak μετέφρασε τη σελίδα `aros.org στα Τσέχικα`__.


__ http://aros-exec.org/modules/newbb/viewtopic.php?topic_id=2319
__ http://ftp.ticklers.org/pub/aminet/driver/video/Wazp3D.readme
__ http://msaros.blogspot.com/2007/10/very-close.html
__ http://www.aros.org/cs


